<!--
 * @Author       : jiangronghua 613870505@qq.com
 * @Date         : 2024-08-30 17:24:35
 * @LastEditTime : 2024-09-01 17:17:48
 * @LastEditors  : jiangronghua
 * @Description  :
-->
<template>
  <view class="container">
    <up-navbar :placeholder="true" bg-color="#F8EFF2" title="隐私协议" autoBack />
    <view class="content">
      <view style="font-weight: bold;">用户注册登录及隐私协议</view>
      <view style="margin-top: 20rpx;">
        在此特别提醒您(用户）在注册成为用户之前，请认
        真阅读本《用户协议》(以下简称“协议”)，确保您充分理解本协议中各条款。请您审慎阅读并选择接受或不接受本协议。您的注册、登录、使用等行为将视为对本协议的接受，并同意接受本协议各项条款的约束。本协议约定杭州晓渔文化咨询有限公司旗下品牌“研攀登考研”(以下简称“研攀登”)与用户之间关于软件服务(以下简称“服务“)的权利义务。“用户”是指注册、登录、使用本服务的个人。本协议可由研攀登随时更新，更新后的协议条款—旦公布即代替原来的协议条款，恕不再另行通知，用户可在研攀登|用户注册登录及隐私协议查阅最新版协议条款。在修改协议条款后，如果用户不接受修改后的条款，请立即停止使用研攀登提供的服务，用户继续使用服务将被视为接受修改后的协议。
        <view>—、账号注册</view>
        <view>
          1、用户在使用本服务前需要注册一个“研攀登”账号。“研攀登”账号应当使用微信授权注册，请用户使用尚未与“研攀登”账号绑定的手机号码，以及未被服务根据本协议封禁的手机号码注册研攀登”账号。服务可以根据用户需求或产品需要对账号注册和绑定的方式进行变更，而无须事先通知用户。
        </view>
        <view> 2、用户注册时应当授权研攀登及使用其个人信息方可成功注册“研攀登”账号。故用户完成注册即表明用户同意服务提取、公开及使用用户的信息。 </view>
        <view> 3、鉴于“研攀登”账号的绑定注册方式，您同意服务在注册时将允许您的手机号码及手机设备识别码等信息用于注册。 </view>
        <view>二、用户个人隐私信息保护 </view>
        <view>
          1、如果研攀登发现或收到他人举报或投诉用户违反本协议约定的，研攀登有权不经通知随时对相关内容，包括但不限于用户资料、发贴记录进行审查、删除，并视情节轻重对违规账号处以包括但不限于警告、账号封禁、设备封禁、功能封禁的处罚，且通知用户处理结果。
        </view>
        <view>2、因违反用户协议被封禁的用户，可以自行与研攀登联系。其中，被实施功能封禁的用户会在封禁期届满后自动恢复被封禁功能。被封禁用户可提交申诉，研攀登将对申诉进行审查，并自行合理判断决定是否变更处罚措施。
        </view>
        <view>3、用户理解并同意，研攀登有权依合理判断对违反有关法律法规或本协议规定的行为进行处罚，对违法违规的任何用户采取适当的法律行动，并依据法律法规保存有关信息向有关部门报告等，用户应承担由此而产生的一切法律责任。
        </view>
        <view> 4、用户理解并同意，因用户违反本协议约定，导致或产生的任何第三方主张的任何索赔、要求或损失，包括合理的律师费，用户应当赔偿研攀登与合作公司、关联公司，并使之免受损害。 </view>
        <view>5、研攀登处理的信息
          根据法律规定，研攀登仅处理实现小程序功能所必要的信息。为了保证您能正常使用登录和使用本hs网站或小程序，研攀登将在获取您的明示同意后，收集您的昵称、头像。为了保证您能正常使用登录和使用本h5网站或小程序的一键登录，研攀登将在获取您的明示同意后，收集您的手机号。为了验证您登录时使用设备的安全性以及身份的合法性，我们可能会记录您设备所在的位置信息、终端MAC地址、OAID、Andiroid
          ID、终端版本型号、网络IP、本机号码、网络类型和手机品牌信息，以便为您提供相关服务。在您使用服务时，我们可能会通过IP地址、GPS、WLAN或基站途径获取您的地理位置信息;您或其
          他用户在使用服务时提供的信息中回能包含您 什地理位置信息，包括您提供的帐号信息中可能包含的您所在地区 信息，您共享的地理标记信息。为保证您正常使用本h5网
          站或小程序的密码重置、密码修改、意见反馈、验证码登录、激活认证功能，我们可能需要接收您的手机号码，服
          务验证码。为保证您正常使用本hs网站或小程序的订单记录、确认订单、订单提交、退款，我们可能需要手机和使用手机号码，订单编号、订单状态、订单金额、个人姓名、地理位置信息和详细地址等信息。为保证您正常使用本hs网站或小程序的估分排名，真实成绩排名，研攀登将在获取您的明示同意后，获取您的相机权限和存储权限，以便为您提供相关服务。为保证您正常使用本hs网站或小程序的意见反馈，真实成绩提交，头像修改，在线客服，研攀登可能需要使用您的照片和视频信息，手机号码，手机设备信息以及位置信息。
        </view>
        <view>6、您的权益 关于您的个人信息，您可以通过以下方式与研攀登联系，行使查阅、复制、更正、删除等法定权利。邮箱:2952891319@qq.com </view>
        <view>7、研攀登对信息的存储 研攀登承诺，除法律法规另有规定外，研攀登对您的信息的保存期限应当为实现处理目的所必要的最短时间。 </view>
        <view>8、信息的使用规则 承诺按照隐私指引的用途使用用户个人信息;如研攀登使用您的信息超出本指引目的或合理范围，研攀登必须在变更使用目的或范围前，再次以弹窗、小程序内隐私政策方式告知。 </view>
        <view>9、信息对外提供 研攀登承诺，不会主动共享或转让您的信息至任何第三方，如存在确需共享或转让时，研攀登应当直接征得或确认第三方征得您的单独同意。</view>
        <view>三、用户发布内容规范 </view>
        <view>
          1、本条所述内容是指用户使用服务的过程中所制作、上载、复制、发布、传播的任何内容，包括但不限于账号头像、名称、用户说明等注册信息及认证资料，或文字、语音、图片、视频、图文等发送、回复或自动回复消息和相关链接页面，以及其他使用账号或本服务所产生的内容。
        </view>
        <view>2、用户不得利用“研攀登”账号或本服务制作、上载、复制、发布、传播如下法律、法规和政策禁止的内容: </view>
        <view>(1)反对宪法所确定的基本原则的;</view>
        <view>(2)危害国家安全，泄露国家秘密，颠覆国家政权，破坏国家统一的;</view>
        <view>(3)损害国家荣誉和利益的;</view>
        <view>(4)煽动民族仇恨、民族歧视，破坏民族团结的; </view>
        <view>(5)破坏国家宗教政策，宣扬邪教和封建迷信的; </view>
        <view>(6)散布谣言，扰乱社会秩序，破坏社会稳定的; </view>
        <view>(7)散布淫秽、色情、赌博、暴力、凶杀、恐怖或者教唆犯罪的; </view>
        <view>(8)侮辱或者诽谤他人，侵害他人合法权益的;</view>
        <view>(9)含有法律、行政法规禁止的其他内容的信息。 </view>
        <view>(9)含有法律、行政法规禁止的其他内容的信息。3、用户不得利用*研攀登”账号或本服务制作、上载、复制、发布、传播如下干扰“服务”正常运营，以及侵犯其他用户或第三方合法权益的内容: </view>
        <view>(1)含有任何性或性暗示的; </view>
        <view> (2)含有辱骂、恐吓、威胁内容的; </view>
        <view> (3)含有骚扰、垃圾广告、恶意信息、诱骗信息的; </view>
        <view> (4)涉及他人隐私、个人信息或资料的; </view>
        <view> (5)侵害他人名誉权、肖像权、知识产权、商业秘密等合法权利的; </view>
        <view> (6)含有其他干扰本服务正常运营和侵犯其他用户或第三方合法权益内容的信息。 </view>
        <view>四、使用规则 </view>
        <view>1、用户在本服务中或通过本服务所传送、发布的任何内容并不反映或代表，也不得被视为反映或代表研攀登的观点、立场或政策，研攀登对此不承担任何责任。 </view>
        <view>2、用户不得利用“研攀登”账号或本服务进行如下行为: </view>
        <view>(1)提交、发布虚假信息，或盗用他人头像或资料，冒充、利用他人名义的; </view>
        <view>(2)强制、诱导其他用户关注、点击链接页面或分享信息的; </view>
        <view>(3)虚构事实、隐瞒真相以误导、欺骗他人的; </view>
        <view>(4)利用技术手段批量建立虚假账号的; </view>
        <view>(5)利用*研攀登”账号或本服务从事任何违法犯罪活动的; </view>
        <view>(6)制作、发布与以上行为相关的方法、工具，或对此类方法、工具进行运营或传播，无论这些行为是否为商业目的; </view>
        <view>(7)其他违反法律法规规定、侵犯其他用户合法权益、干扰“研攀登”正常运营或服务未明示授权的行为。 </view>
        <view>3、用户须对利用*研攀登”账号或本服务传送信息的真实性、合法性、无害性、准确性、有效性等全权负责，与用户所传播的信息相关的任何法律责任由用户自行承担，与研攀登无关。
          如因此给研攀登或第三方造成损害的，用户应当依法予以赔偿。 </view>
        <view>
          4、研攀登提供的服务中可能包括广告，用户同意在使用过程中显示研攀登和第三方供应商、合作伙伴提供的广告。除法律法规明确规定外，用户应自行对依该广告信息进行的交易负责，对用户因依该广告信息进行的交易或前述广告商提供的内容而遭受的损失或损害，研攀登不承担任何责任。
        </view>
        <view>五、其他 </view>
        <view> 1、研攀登郑重提醒用户注意本协议中免除研攀登责任和限制用户权利的条款，请用户仔细阅读，自主考虑风险。未成年人应在法定监护人的陪同下阅读本协议。 </view>
        <view> 2、本协议的效力、解释及纠纷的解决，适用于中华人民共和国法律。若用户和研攀登之间发生任何纠纷或争议，首先应友好协商解决，协商不成的，用户同意将纠纷或争议提交研攀登住所地有管辖权的人民法院管辖。 </view>
        <view> 3、本协议的任何条款无论因何种原因无效或不具可执行性，其余条款仍有效，对双方具有约束力。 本《协议》版权由研攀登所有，研攀登保留一切对本《协议》解释的权利 杭州晓渔文化咨询有限公司</view>
      </view>
    </view>
  </view>
</template>
<script setup lang="ts">
</script>
<style scoped lang="scss">
.container {
  min-height: 100vh;
  background: linear-gradient(180deg, #F8EFF2 0%, #F6F5F8 100%);
  display: flex;
  flex-direction: column;
  flex: 1;
  padding: 32rpx;
  box-sizing: border-box;
}
</style>
